---
title: ContourSettingItem
classe: Autodesk.Revit.DB.ContourSettingItem
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ContourSettingItem

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `contourSettingItem.IsValidObject` | Boolean |
| `Double Start { get; }` | `contourSettingItem.Start` | Double |
| `Double Step { get; }` | `contourSettingItem.Step` | Double |
| `Double Stop { get; }` | `contourSettingItem.Stop` | Double |
| `ElementId SubCategoryId { get; }` | `contourSettingItem.SubCategoryId` | ElementId |
| `ContourSettingItemType Type { get; }` | `contourSettingItem.Type` | ContourSettingItemType |
| `Void Dispose()` | `contourSettingItem.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```